DRL_py/env/DRL_base_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            patch;
        nFaces          255;
        startFace       27028;
    }
    bottom
    {
        type            patch;
        nFaces          255;
        startFace       27283;
    }
    inlet
    {
        type            patch;
        nFaces          74;
        startFace       27538;
    }
    outlet
    {
        type            patch;
        nFaces          37;
        startFace       27612;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13678;
        startFace       27649;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13678;
        startFace       41327;
    }
    cylinder
    {
        type            patch;
        nFaces          54;
        startFace       55005;
    }
)

// ************************************************************************* //
